d=int(input("Введите день: ")) # вводим день
m=int(input("Введите месяц: ")) # вводим месяц

if (m == 3 and d >= 1) or (m in [4, 5]) or (m == 5 and d <= 31): # пишем условие
    print("Весна") # выводим весна если введенные данные попадают в диапазон условия
elif (m == 6 and d >= 1) or (m in [7, 8]) or (m == 8 and d <= 31): #пишем условие
    print("Лето") # выводим
elif (m == 9 and d >= 1) or (m in [10, 11]) or (m == 11 and d <= 30): # пишем условие
    print("Осень") # выводим
elif (m == 12 and d >= 1) or (m in [1, 2]) or (m == 2 and d <= 28): # пишем условие
    print("Зима") # выводим
else: # во всех других случаях
    print("Введена неккоректная дата") # пишем что неккоректная дата
