d = int(input("Введите день (число от 1 до 31): ")) # вводим день
m = int(input("Введите месяц (число от 1 до 12): ")) # вводим месяц

if (m == 3 and d >= 1 and d <=31) or (m == 4 and d >= 1 and d <=31) or (m == 5 and d >= 1 and d <=31): # пишем условие и если введенные данные попадают в диапазон то 
    print("Весна") # выводим это
elif (m == 6 and d >= 1 and d <= 31) or (m == 7 and d >= 1 and d <= 31) or (m == 8 and d >= 1 and d <= 31): # пишем другое условие
    print("Лето") # выводим лето
elif (m == 9 and d >= 1 and d <= 30) or  (m == 10 and d >= 1 and d <= 30) or  (m == 11 and d >= 1 and d <= 30): # пишем другое условие
    print("Осень") # пишем это
elif (m == 12 and d >= 1 and d <= 31)or (m == 1 and d >= 1 and d <= 31) or (m == 2 and d >= 1 and d <= 28): # и еще одно условие
    print("Зима") # это зима
else:# а если ваще не попадает в условие
    print("Введена неккоректная дата") # то неккоректные данные
